Autodesk.Revit.DB.TextElement.LineWidth
Width of widest line of the text element
Remarks:
The value is in sheet units, meaning it is as when measured on a printed sheet.
This is a read-only property, for the width of the widest line is
calculated depending on the text and its wrapping within the box.

Autodesk.Revit.DB.TextElement.Width
Width of the area of the text content.
Remarks:
This property supersedes the older Autodesk.Revit.DB.TextElement.LineWidth property which has been deprecated.
The value is in sheet units, meaning it is as when measured on a printed sheet.
The measurement is of the text content only; the border around it (if specified) is excluded.
For a text element which does is set not to use text wrapping the width is calculated
to fit the longest line (a single line, typically) of the text. A setting the width explicitly
by assigning value to this property will automatically activate text-wrapping for the element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: A valid width must have a positive value of less then 1000 feet (approx 300 m).
Since:
2016

Autodesk.Revit.DB.TextElement.Align
Alignment attributes of the text.
Since:
2012